; domain
(define (domain ferry)
  (:requirements :strips :constraints :negative-preconditions)
   (:predicates (not-eq ?v5 ?v2)
		(pred_4 ?v8)
		(pred_2 ?v4)
		(pred_3 ?v4)
		(pred_6 ?v8 ?v4)
		(pred_5)
		(pred_1 ?v8))

   (:action op_1
       :parameters  (?v3 ?v1)
       :precondition (and (not-eq ?v3 ?v1) 
                          (pred_2 ?v3) (pred_2 ?v1) (pred_3 ?v3))
       :effect (and  (pred_3 ?v1)
		     (not (pred_3 ?v3))))


   (:action op_3
       :parameters (?v7 ?v6)
       :precondition  (and  (pred_4 ?v7) (pred_2 ?v6)
			    (pred_6 ?v7 ?v6) (pred_3 ?v6) (pred_5))
       :effect (and (pred_1 ?v7)
		    (not (pred_6 ?v7 ?v6)) 
		    (not (pred_5))))

   (:action op_2
       :parameters  (?v7  ?v6)
       :precondition  (and  (pred_4 ?v7) (pred_2 ?v6)
			    (pred_1 ?v7) (pred_3 ?v6))
       :effect (and (pred_6 ?v7 ?v6)
		    (pred_5)
		    (not (pred_1 ?v7)))))

; problem
(define (problem ferry-l5-c3)
(:domain ferry)
(:objects obj_08 obj_04 obj_01 obj_07 obj_05 
          obj_06 obj_02 obj_03 
)
(:init
(pred_2 obj_08)
(pred_2 obj_04)
(pred_2 obj_01)
(pred_2 obj_07)
(pred_2 obj_05)
(pred_4 obj_06)
(pred_4 obj_02)
(pred_4 obj_03)
(not-eq obj_08 obj_04)
(not-eq obj_04 obj_08)
(not-eq obj_08 obj_01)
(not-eq obj_01 obj_08)
(not-eq obj_08 obj_07)
(not-eq obj_07 obj_08)
(not-eq obj_08 obj_05)
(not-eq obj_05 obj_08)
(not-eq obj_04 obj_01)
(not-eq obj_01 obj_04)
(not-eq obj_04 obj_07)
(not-eq obj_07 obj_04)
(not-eq obj_04 obj_05)
(not-eq obj_05 obj_04)
(not-eq obj_01 obj_07)
(not-eq obj_07 obj_01)
(not-eq obj_01 obj_05)
(not-eq obj_05 obj_01)
(not-eq obj_07 obj_05)
(not-eq obj_05 obj_07)
(pred_5)
(pred_6 obj_06 obj_01)
(pred_6 obj_02 obj_08)
(pred_6 obj_03 obj_01)
(pred_3 obj_08)
)
(:goal
(and
(pred_6 obj_06 obj_04)
(pred_6 obj_02 obj_08)
(pred_6 obj_03 obj_07)
)
)

(:constraints
  (and
    (sometime-before  (pred_6 obj_06 obj_04) (pred_3 obj_07))
    (sometime-before  (pred_6 obj_03 obj_07) (pred_3 obj_04))
  )
)
)

; plan
1. (op_1 obj_08 obj_07)
   deleted: (pred_3 obj_08)
   added: (pred_3 obj_07)
   goals met: 1 of 3
2. (op_1 obj_07 obj_01)
   deleted: (pred_3 obj_07)
   added: (pred_3 obj_01)
   goals met: 1 of 3
3. (op_3 obj_03 obj_01)
   deleted: (pred_6 obj_03 obj_01) (pred_5)
   added: (pred_1 obj_03)
   goals met: 1 of 3
4. (op_1 obj_01 obj_07)
   deleted: (pred_3 obj_01)
   added: (pred_3 obj_07)
   goals met: 1 of 3
5. (op_1 obj_07 obj_04)
   deleted: (pred_3 obj_07)
   added: (pred_3 obj_04)
   goals met: 1 of 3
6. (op_2 obj_03 obj_04)
   deleted: (pred_1 obj_03)
   added: (pred_6 obj_03 obj_04) (pred_5)
   goals met: 1 of 3
7. (op_1 obj_04 obj_01)
   deleted: (pred_3 obj_04)
   added: (pred_3 obj_01)
   goals met: 1 of 3
8. (op_3 obj_06 obj_01)
   deleted: (pred_6 obj_06 obj_01) (pred_5)
   added: (pred_1 obj_06)
   goals met: 1 of 3
9. (op_1 obj_01 obj_04)
   deleted: (pred_3 obj_01)
   added: (pred_3 obj_04)
   goals met: 1 of 3
10. (op_2 obj_06 obj_04)
   deleted: (pred_1 obj_06)
   added: (pred_6 obj_06 obj_04) (pred_5)
   goals met: 2 of 3
11. (op_3 obj_03 obj_04)
   deleted: (pred_6 obj_03 obj_04) (pred_5)
   added: (pred_1 obj_03)
   goals met: 2 of 3
12. (op_1 obj_04 obj_07)
   deleted: (pred_3 obj_04)
   added: (pred_3 obj_07)
   goals met: 2 of 3
13. (op_2 obj_03 obj_07)
   deleted: (pred_1 obj_03)
   added: (pred_6 obj_03 obj_07) (pred_5)
   goals met: 3 of 3
